tanx53213/UnionCamera/portable_code/007__UART3+使用ESP8266模块连接热点实现上网+访问别人的服务器+使用MQTT通信方式和巴法云物联网进行通信/MYM4_LIB/esp8266/esp8266_getweather.c
#include "esp8266.h"
#include "esp8266_getweather.h"
#include "cjson.h"
#include "delay.h"
#include "uart.h"
#include <stdio.h>
#include <string.h>

// 定义CJCON数据解析后存放数据的结构体
Results results[7] = {0};

/**
  * @brief  使用CJSON解析反馈的天气信息
  * @note  
  *			1、cJSON数据解析示例代码，如果解析数据不确定是否格式正确可以利用以下网站对需解析数据提前验证：
  *				https://lzltool.cn/string-escape
  *
  *			2、利用cJSON对数据进行解析时，需要设置工程的 Heap_Size 大小，即打开项目工程中的startup_stm32f40_41xxx.s启动文件，把Heap_Size修改为合适值，如：0x00004000
  *
  * @param  sbuf：   cjson协议包
  *         results：指向天气结构体的指针
  * @retval 成功：返回0
  *         失败：返回小于0的数
  */
int8_t weather_cjson_parse(char *sbuf, Results *results)
{
	cJSON *Json=NULL,*Results=NULL,*Array=NULL,*Location=NULL,*Now=NULL,*Last_update=NULL,*Item=NULL;
	
	char *p_data = sbuf;
	
	//解析Json数据包
	Json = cJSON_Parse(p_data);
	if(Json == NULL)												//检测Json数据包是否存在语法上的错误，返回NULL表示数据包无效
	{
		printf("Error before: [%s] \r\n", cJSON_GetErrorPtr());		//打印数据包语法错误的位置
		return -1;
	}
	else
	{
		if((Results = cJSON_GetObjectItem(Json,"results")) != NULL)	//匹配字符串"results",获取数组内容
		{
			//获取数组中对象个数
			printf("cJSON_GetArraySize: size = %d\r\n", cJSON_GetArraySize(Results)); 
			
			if((Array = cJSON_GetArrayItem(Results,0)) != NULL)//获取父对象内容
			{
				//匹配子对象 location 
				if((Location = cJSON_GetObjectItem(Array,"location")) != NULL)
				{
					printf("---------------------------------Location-------------------------------\r\n");
					if((Item = cJSON_GetObjectItem(Location,"id")) != NULL)   //匹配子对象1中的成员 "id"
					{
						memcpy(results[0].location.id,Item->valuestring,strlen(Item->valuestring));
						printf("%s: %s \r\n",Item->string,results[0].location.id);
					}
					if((Item = cJSON_GetObjectItem(Location,"name")) != NULL) //匹配子对象1中的成员 "name"
					{
						memcpy(results[0].location.name,Item->valuestring,strlen(Item->valuestring));
						printf("%s: %s \r\n",Item->string,results[0].location.name);
					}
					if((Item = cJSON_GetObjectItem(Location,"country")) != NULL)//匹配子对象1中的成员 "country"
					{
						memcpy(results[0].location.country,Item->valuestring,strlen(Item->valuestring));
						printf("%s: %s \r\n",Item->string,results[0].location.country);
					}
					if((Item = cJSON_GetObjectItem(Location,"path")) != NULL)  //匹配子对象1中的成员 "path"
					{
						memcpy(results[0].location.path,Item->valuestring,strlen(Item->valuestring));
						printf("%s: %s \r\n",Item->string,results[0].location.path);
					}
					if((Item = cJSON_GetObjectItem(Location,"timezone")) != NULL)//匹配子对象1中的成员 "timezone"
					{
						memcpy(results[0].location.timezone,Item->valuestring,strlen(Item->valuestring));
						printf("%s: %s \r\n",Item->string,results[0].location.timezone);
					}
					if((Item = cJSON_GetObjectItem(Location,"timezone_offset")) != NULL)//匹配子对象1中的成员 "timezone_offset"
					{
						memcpy(results[0].location.timezone_offset,Item->valuestring,strlen(Item->valuestring));
						printf("%s: %s \r\n",Item->string,results[0].location.timezone_offset);
					}
				}
				//匹配子对象 now 
				if((Now = cJSON_GetObjectItem(Array,"now")) != NULL)
				{
					printf("---------------------------------Now------------------------------------\r\n");
					if((Item = cJSON_GetObjectItem(Now,"text")) != NULL)//匹配子对象2中的成员 "text"
					{
						memcpy(results[0].now.text,Item->valuestring,strlen(Item->valuestring));
						printf("%s: %s \r\n",Item->string,results[0].now.text);
					}
					if((Item = cJSON_GetObjectItem(Now,"code")) != NULL)//匹配子对象2中的成员 "code"
					{
						memcpy(results[0].now.code,Item->valuestring,strlen(Item->valuestring));
						printf("%s: %s \r\n",Item->string,results[0].now.code);
					}
					if((Item = cJSON_GetObjectItem(Now,"temperature")) != NULL) //匹配子对象2中的成员 "temperature"
					{
						memcpy(results[0].now.temperature,Item->valuestring,strlen(Item->valuestring));
						printf("%s: %s \r\n",Item->string,results[0].now.temperature);
					}
				}
				//匹配子对象 last_update 
				if((Last_update = cJSON_GetObjectItem(Array,"last_update")) != NULL)
				{
					printf("---------------------------------Last_update----------------------------\r\n");
					memcpy(results[0].last_update,Last_update->valuestring,strlen(Last_update->valuestring));
					printf("%s: %s \r\n",Last_update->string,results[0].last_update);
				}
			} 
		}
	}

	//释放cJSON_Parse()分配出来的内存空间
	cJSON_Delete(Json); 
	Json = NULL;
	return 0;
}


/**
  * @brief  通过ESP8266模块获取天气信息
  * @note   时间API来自于心知天气(https://www.seniverse.com/insights)
  * @param  xztq_key：心知天气的密钥(自行申请)
  *         city_buf：需要查询天气的城市
  * @retval 成功：返回0
  *         失败：返回小于0的数
  */
int32_t ESP8266_GetWeatherFunc(char *xztq_key, char *city_buf)
{
	
	int8_t ret    = 0;
    char weather_buf[512]      = {0};
    int32_t i                  = 0;
    int16_t flag               = 0;

    
    // 天气情况
    char *weathre_str[] = {"Sunny", "Clear", "Fair", "Fair", "Cloudy", "Partly Cloudy", "Partly Cloudy", "Mostly Cloudy", "Mostly Cloudy", "Overcast", 
                           "Shower", "Thundershower", "Thundershower with Hail", "Light Rain", "Moderate Rain","Heavy Rain", "Storm", "Heavy Storm", "Severe Storm", "Ice Rain", 
                           "Sleet", "Snow Flurry", "Light Snow", "Moderate Snow", "Heavy Snow", "Snowstorm", "Dust", "Sand", "Duststorm", "Sandstorm"};
    
	char *weathre_num[] = {"0", "1", "2", "3", "4", "5", "6", "7", "8", "9", 
                           "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", 
                           "20", "21", "22", "23", "24", "25", "26", "27", "28", "29"};
    				   
	// 1、与网站建立连接
	ret =  ESP8266_ConnectServer("TCP", "116.62.81.138", 80);
	if(ret < 0)
	{
		printf("与网站建立连接失败\r\n");
		return -4;
	}
	delay_ms(1000);		

		
	// 2、开启透传模式
	ret =  ESP8266_EnterTransparentTransmission();
	if(ret < 0)
	{
		printf("开启透传模式失败\r\n");
		return -6;
	}
	delay_ms(1000);	
	

	// 清空之前存储的值
	memset((void *)u3_recvbuf, 0, sizeof(u3_recvbuf));

    
	// 3、向网站提出请求   
    sprintf(weather_buf,"GET https://api.seniverse.com/v3/weather/now.json?key=%s&location=%s&language=zh-Hans&unit=c\r\n", city_buf, xztq_key);
	ESP8266_SendATCmd(weather_buf);
	delay_ms(2000);	

    // 4、解析获取到的天气
    printf("u3_recvbuf = %s\r\n", u3_recvbuf);                      // 打印从网站返回的时间的数据(全部)
	weather_cjson_parse((char *)u3_recvbuf, results);

    // 获取天气情况
    i = 0;
    for(i=0; i<30; i++)
    {
        if(strcmp(results->now.code, weathre_num[i]) == 1)
        {
            flag = i;
        }
    }
    printf("天气情况 = %s\r\n", weathre_str[flag+1]);
	printf("天气温度 = %s\r\n", results[0].now.temperature);
	
	// 清空接收缓冲区
	memset((void *)u3_recvbuf, 0, sizeof(u3_recvbuf));
	
	// 清空接收计数值
	u3_count = 0;
	
	// 5、退出透传模式(断开连接)
	ret = ESP8266_ExitTransparentTransmission();
	if(ret < 0)
	{
		printf("退出透传模式(断开连接)失败\r\n");
		return -1;
	}
	delay_ms(1000);	
    return 0;
}
